{
    "type": "ENFJ",
    "long_name": "Extraverted Intuitive Feeling Judging",
    "description": "<p>ENFJs are the benevolent 'pedagogues' of humanity. They have tremendous charisma by which many are drawn into their nurturant tutelage and/or grand schemes. Many ENFJs have tremendous power to manipulate others with their phenomenal interpersonal skills and unique salesmanship. But it's usually not meant as manipulation -- ENFJs generally believe in their dreams, and see themselves as helpers and enablers, which they usually are.</p><p>ENFJs are global learners. They see the big picture. The ENFJs focus is expansive. Some can juggle an amazing number of responsibilities or projects simultaneously. Many ENFJs have tremendous entrepreneurial ability.</p><p>ENFJs are, by definition, Js, with whom we associate organization and decisiveness. But they don't resemble the SJs or even the NTJs in organization of the environment nor occasional recalcitrance. ENFJs are organized in the arena of interpersonal affairs. Their offices may or may not be cluttered, but their conclusions (reached through feelings) about people and motives are drawn much more quickly and are more resilient than those of their NFP counterparts.</p><p>ENFJs know and appreciate people. Like most NFs, (and Feelers in general), they are apt to neglect themselves and their own needs for the needs of others. They have thinner psychological boundaries than most, and are at risk for being hurt or even abused by less sensitive people. ENFJs often take on more of the burdens of others than they can bear.</p><p>TRADEMARK: &quot;The first shall be last&quot;</p><p>This refers to the open-door policy of ENFJs. One ENFJ colleague always welcomes me into his office regardless of his own circumstances. If another person comes to the door, he allows them to interrupt our conversation with their need. While discussing that need, the phone rings and he stops to answer it. Others drop in with a 'quick question.' I finally get up, go to my office and use the call waiting feature on the telephone. When he hangs up, I have his undivided attention!</p><p>Extraverted Feeling rules the ENFJ's psyche. In the sway of this rational function, these folks are predisposed to closure in matters pertaining to people, and especially on behalf of their beloved. As extraverts, their contacts are wide ranging. Face-to-face relationships are intense, personable and warm, though they may be so infrequently achieved that intimate friendships are rare.</p><p>Like their INFJ cousins, ENFJs are blessed through introverted intuition with clarity of perception in the inner, unconscious world. Dominant Feeling prefers to find the silver lining in even the most beggarly perceptions of those in their expanding circle of friends and, of course, in themselves. In less balanced individuals, such mitigation of the unseemly eventually undermines the ENFJ's integrity and frequently their good name. In healthier individuals, deft use of this awareness of the inner needs and desires of others enables this astute type to win friends, influence people, and avoid compromising entanglements.</p><p>The dynamic nature of their intuition moves ENFJs from one project to another with the assurance that the next one will be perfect, or much more nearly so than the last. ENFJs are continually looking for newer and better solutions to benefit their extensive family, staff, or organization.</p><p>Sensing is extraverted. ENFJs can manage details, particularly those necessary to implement the prevailing vision. These data have, however, a magical flexible quality. Something to be bought can be had for a song; the same something is invaluable when it's time to sell. (We are not certain, but we suspect that such is the influence of the primary function.) This wavering of sensory perception is made possible by the weaker and less mature status with which the tertiary is endowed.</p><p>Introverted Thinking is least apparent and most enigmatic in this type. In fact, it often appears only when summoned by Feeling. At times only in jest, but in earnest if need be, Thinking entertains as logical only those conclusions which support Feeling's values. Other scenarios can be shown invalid or at best significantly inferior. Such &quot;Thinking in the service of Feeling&quot; has the appearance of logic, but somehow it never quite adds up.</p><p>Introverted Thinking is frequently the focus of the spiritual quest of ENFJs. David's lengthiest psalm, 119, pays it homage. &quot;Law,&quot; &quot;precept,&quot; &quot;commandment,&quot; &quot;statute:&quot; these essences of inner thinking are the mysteries of Deity for which this great Feeler's soul searched.</p>",
    "famous": [
        "Abraham Lincoln",
        "Ronald Regan",
        "Abraham Maslow",
        "Ross Perot",
        "Sean Connery",
        "Elizabeth Dole",
        "Bob Saget",
        "Dick Van Dyke",
        "Andy Griffith",
        "James Garner"
    ]
}
