{
    "type": "ENFP",
    "long_name": "Extraverted Intuitive Feeling Perceiving",
    "description": "<p>General: ENFPs are both &quot;idea&quot;-people and &quot;people&quot;-people, who see everyone and everything as part of an often bizarre cosmic whole. They want to both help (at least, their own definition of &quot;help&quot;) and be liked and admired by other people, on bo th an individual and a humanitarian level. They are interested in new ideas on principle, but ultimately discard most of them for one reason or another.</p><p>Social/Personal Relationships: ENFPs have a great deal of zany charm, which can ingratiate them to the more stodgy types in spite of their unconventionality. They are outgoing, fun, and genuinely like people. As SOs/mates they are warm, affectionate (l ots of PDA), and disconcertingly spontaneous. However, attention span in relationships can be short; ENFPs are easily intrigued and distracted by new friends and acquaintances, forgetting about the older ones for long stretches at a time. Less mature ENFPs may need to feel they are the center of attention all the time, to reassure them that everyone thinks they're a wonderful and fascinating person.</p><p>ENFPs often have strong, if unconvential, convictions on various issues related to their Cosmic View. They usually try to use their social skills and contacts to persuade people gently of the rightness of these views; his sometimes results in their negle cting their nearest and dearest while flitting around trying to save the world.</p><p>Work Environment: ENFPs are pleasant, easygoing, and usually fun to work with. They come up with great ideas, and are a major asset in brainstorming sessions. Followthrough tends to be a problem, however; they tend to get bored quickly, especially if a newer, more interesting project comes along. They also tend to be procrastinators, both about meeting hard deadlines and about performing any small, uninteresting tasks that they've been assigned. ENFPs are at their most useful when working in a group w ith a J or two to take up the slack.</p><p>ENFPs hate bureaucracy, both in principle and in practice; they will always make a point of launching one of their crusades against some aspect of it.</p><p>ENFPs are friendly folks. Most are really enjoyable people. Some of the most soft-hearted people are ENFPs.</p><p>ENFPs have what some call a &quot;silly switch.&quot; They can be intellectual, serious, all business for a while, but whenever they get the chance, they flip that switch and become CAPTAIN WILDCHILD, the scourge of the swimming pool, ticklers par excellence. Som etimes they may even appear intoxicated when the &quot;switch&quot; is flipped.</p><p>One study has shown that ENFPs are significantly overrepresented in psychodrama. Most have a natural propensity for role-playing and acting.</p><p>ENFPs like to tell funny stories, especially about their friends. This penchant may be why many are attracted to journalism. I kid one of my ENFP friends that if I want the sixth fleet to know something, I'll just tell him.</p><p>ENFPs are global learners. Close enough is satisfactory to the ENFP, which may unnerve more precise thinking types, especially with such things as piano practice (&quot;three quarter notes or four ... what's the difference?&quot;) Amazingly, some ENFPs are adept at exacting disciplines such as mathematics.</p><p>Friends are what life is about to ENFPs, moreso even than the other NFs. They hold up their end of the relationship, sometimes being victimized by less caring individuals. ENFPs are energized by being around people. Some have real difficulty being alone , especially on a regular basis.</p><p>One ENFP colleague, a social worker, had such tremendous interpersonal skills that she put her interviewers at ease during her own job interview. She had the ability to make strangers feel like old friends.</p><p>ENFPs sometimes can be blindsided by their secondary Feeling function. Hasty decisions based on deeply felt values may boil over with unpredictable results. More than one ENFP has abruptly quit a job in such a moment.</p><p>The physical world, both geos and kosmos, is the ENFP's primary source of information. Rather than sensing things as they are, dominant intuition is sensitive to things as they might be. These extraverted intuitives are most adept with patterns and connections. Their natural inclination is toward relationships, especially among people or living things.</p><p>Intuition leans heavily on feeling for meaning and focus. Its best patterns reflect the interesting points of people, giving rise to caricatures of manner, speech and expression.</p><p>Auxiliary feeling is nonverbally implied more often than it is openly expressed. When expressed, this logic has an aura of romance and purity that may seem out of place in this flawed, imperfect world. In its own defense, feeling judgement frequently and fleetly gives way to humor. ENFPs who publicize their feelings too often may put off some of the crowd of friends they naturally attract.</p><p>Thinking, the process which runs to impersonal conclusions, holds the extraverted tertiary position. Used on an occasional basis, ENFPs may benefit greatly from this ability. Less mature and lacking the polish of higher order functions, Thinking is not well suited to be used as a prominent function. As with other FP types, the ENFP unwary of Thinking's limitations may find themselves most positively mistaken.</p><p>Sensing, the least discernible ENFP function, resides in the inner world where reality is reduced to symbols and icons--ideas representing essences of external realities. Under the influence of the ever-present intuition, the ENFP's sensory perceptions are in danger of being replaced by hypothetical data consistent with pattern and paradigm. When it is protected and nourished, introverted sensing provides information about the fixed. From such firm anchoring ENFPs are best equipped to launch into thousands of plausibilities and curiosities yet to be imagined.</p><p>Perhaps the combination of introverted Feeling and childlike introverted Sensing is responsible for the silent pull of ENFPs to the wishes of parents, authority figures and friends. Or perhaps it's the predominance of indecisive intuition in combination with the ambiguity of secondary Fi and tertiary Te that induces these kind souls to capitulate even life-affecting decisions. Whatever the dynamic, ENFPs are strongly influenced by the opinions of their friends.</p>",
    "famous": [
        "Andy Rooney",
        "Meg Ryan",
        "Robin Williams",
        "Sandra Bullock",
        "Robert Downey",
        "Alicia Silverstone",
        "Andy Kaufman",
        "Dave Thomas",
        "Bill Cosby",
        "Carol Burnett"
    ]
}
