{
    "type": "ENTJ",
    "long_name": "Extraverted Intuitive Thinking Judging",
    "description": "<p>&quot;I don't care to sit by the window on an airplane. If I can't control it, why look?&quot;</p><p>ENTJs have a natural tendency to marshall and direct. This may be expressed with the charm and finesse of a world leader or with the insensitivity of a cult leader. The ENTJ requires little encouragement to make a plan. One ENTJ put it this way... &quot;I make these little plans that really don't have any importance to anyone else, and then feel compelled to carry them out.&quot; While &quot;compelled&quot; may not describe ENTJs as a group, nevertheless the bent to plan creatively and to make those plans realiity is a common theme for NJ types.</p><p>ENTJs are often &quot;larger than life&quot; in describing their projects or proposals. This ability may be expressed as salesmanship, story-telling facility or stand-up comedy. In combination with the natural propensity for filibuster, our hero can make it very difficult for the customer to decline.</p><p>TRADEMARK: -- &quot;I'm really sorry you have to die.&quot; (I realize this is an overstatement. However, most Fs and other gentle souls usually chuckle knowingly at this description.)</p><p>ENTJs are decisive. They see what needs to be done, and frequently assign roles to their fellows. Few other types can equal their ability to remain resolute in conflict, sending the valiant (and often leading the charge) into the mouth of hell. When challenged, the ENTJ may by reflex become argumentative. Alternatively (s)he may unleash an icy gaze that serves notice: the ENTJ is not one to be trifled with.</p><p>&quot;Unequivocating&quot; expresses the resoluteness of the ENTJ's dominant function. Clarity of convictions endows these Thinkers with a knack for debate, or wanting knack, a penchant for argument. The light and heat generated by Thinking at the helm can be impressive; perhaps even overwhelming. Experience teaches many ENTJs that restraint may often be the better part of valor, lest one find oneself victorious but alone.</p><p>The auxiliary function explores the blueprints of archetypal patterns and equips Thinking with a fresh, dynamic sense of how things work. Improvising on the fly is something many ENTJs do very well. As Thinking's subordinate, insights are of value only insofar as they further the Right, True Cause celebre. [n.b.: ENTJs are capable of living on a higher plane, if you will, and learning to value individuals even above their principles. The above dynamic suggests less individuation.]</p><p>Sensing reaches out to embrace that which physically touches it. ENTJs have an awareness of the real; of that which exists. By stilling the engines of Thinking and iNtuition, this type may experience the Here and Now, and know things not dreamt of nor even postulated in iNtuition's philosophy. Sensing's minor role, however, puts it at risk for distortion or extreme weakness beneath the hustle and bustle of the giants N and T.</p><p>Feeling is romantic, as the ethereal as the inner world from whence it doth emerge. When it be awake, feeling evokes great passion that knows not nuance of proportion nor context. Perhaps these lesser functions inspire glorious recreational quests in worlds that never were, or may only ever be in fantasy. When overdone or taken too seriously, Fi turned outward often becomes maudlin or melodramatic. Feeling in this type appears most authentic when implied or expressed covertly in a firm handshake, accepting demeanor, or act of sacrifice thinly covered by excuses of lack of any personal interest in the relinquished item.</p>",
    "famous": [
        "Franklin D. Roosevelt",
        "Richard M. Nixon",
        "Harrison Ford",
        "Steve Martin",
        "Margaret Thatcher",
        "Al Gore",
        "Dave Letterman",
        "Newt Gingrich",
        "Patrick Stewart",
        "Jim Carrey"
    ]
}
