{
    "type": "ESFP",
    "long_name": "Extraverted Sensing Feeling Perceiving",
    "description": "<p>&quot;Where's the party?&quot; ESFPs love people, excitement, telling stories and having fun. The spontaneous, impulsive nature of this type is almost always entertaining. And ESFPs love to entertain -- on stage, at work, and/or at home. Social gatherings are an energy boost to these &quot;people&quot; people.</p><p>SPs sometimes think and talk in more of a spider-web approach. Several of my ESFP friends jump from thought to thought in mid-sentence, touching here or there in a manner that's almost incoherent to the listener, but will eventually cover the waterfront by skipping on impulse from one piece of information to another. It's really quite fascinating.</p><p>New! ESFPs are attracted to new ideas, new fashions, new gadgets, new ______. Perhaps it's the newness of life that attracts ESFPs to elementary education, especially to preschool and kindergarten.</p><p>ESFPs love to talk to people about people. Some of the most colorful storytellers are ESFPs. Their down-to-earth, often homespun wit reflects a mischievous benevolence.</p><p>Almost every ESFP loves to talk. Some can be identified by the twenty minute conversation required to ask or answer a simple factual question.</p><p>The dominant function of ESFPs is concerned with the reality that is perceived through the senses. This type's prime directive is to examine the tangible through taste, touch, sight, feeling and hearing. ESFPs' need for new experiences surely results from this function. Feeling gives focus to the collected information, producing the amiable nature of this type. As perceivers, ESFPs do not linger on moral concerns unless it is in service of a Greater Good and/or a unifying cause.</p><p>Feeling, which tends to decision-making in the interest of individual beings, is auxiliary to sensing. As with all introverted functions, feeling for ESFPs has a surreal, cryptic, quintessential nature. It is more often implied than verbally expressed, more apparent in countenance and deed rather than word or creed. Feeling takes care that playful pokes and pranks do no harm to the victim.</p><p>This tertiary function is at the ready to give definitive answers when the world requires them. It provides a measure of balance to Introverted Feeling, allowing the ESFP some level of boundary and protection from those who would take advantage. When overused or overestimated, however, Thinking becomes a liability. ESFPs do well to seek out confirmation of the soundness of tough-minded decisions.</p><p>This function is least visible. As is the nature of the inferior (fourth) function, ESFP intuition lacks a sense of balance. This type seems most successful in deducing patterns and seeing connections only after a thorough examination of the facts (which process appears quite unorganized and haphazard to non-SPs). Although some ESFPs may develop such abilities, the mastery of logic, analysis and abstraction is usually difficult and wearying, and not very much fun.</p>",
    "famous": [
        "Woody Harrelson",
        "Kathy Lee Gifford",
        "Arsenio Hall",
        "Kyle Petty",
        "Goldie Hawn",
        "Willard Scott",
        "Eva Gabor",
        "Bob Hope",
        "Gracie Allen",
        "Dale Evans"
    ]
}
