{
    "type": "ESTJ",
    "long_name": "Extraverted Sensing Thinking Judging",
    "description": "<p>&quot;Every right-minded man has a philosophy of life, whether he knows it or not. Hidden away in his mind are certain governing principles, whether he formulates them in words or not, which govern his life. Surely his ideal ought to be to contribute all that he can, however little it may be, whether of money or service, to human progress.&quot;</p><p>--John D. Rockefeller, Random Reminiscences of Men and Events</p><p>ESTJs thrive on order and continuity. Being extraverted, their focus involves organization of people, which translates into supervision. While ENTJs enjoy organizing and mobilizing people according to their own theories and tactically based agendas, ESTJs are content to enforce &quot;the rules,&quot; often dictated by tradition or handed down from a higher authority.</p><p>ESTJs are joiners. They seek out like-minded companions in clubs, civic groups, churches and other service organizations. The need for belonging is woven into the fiber of SJs. The family likewise is a central focus for ESTJs, and attendance at such events as weddings, funerals and family reunions is obligatory.</p><p>Tradition is important to the ESTJ. Holidays, birthdays and other annual celebrations are remembered and observed often religiously by this type. The ESTJ is inclined to seek out his roots, to trace the family heritage back to honored ancestors both for a sense of family respectability and for a sense of security and belonging.</p><p>Service, the tangible expression of responsibility, is another key focus for ESTJs. They love to provide and to receive good service. The ESTJ merchant who provides dependable service has done much to enhance her self image.</p><p>ESTJs have an acute sense for orthodoxy. Much of their evaluation of persons and activities reflects their strong sense of what is &quot;normal&quot; and what isn't. ESTJ humor is frequently centered around something or someone being off center or behaving abnormally.</p><p>ESTJs promote the work ethic. Power, position and prestige should be worked for and earned. Laziness is rarely viewed with ambivalence nor benevolence by this type.</p><p>&quot;Some men can make decisions and some cannot. Some men fret and delay under criticism. I used to have a saying that applies here, and I note that some people have picked it up&quot; [which refers to &quot;If you can't stand the heat, get out of the kitchen.&quot;]. (Truman, Harry S., Mr. Citizen)</p><p>The ESTJ is outspoken, a person of principles, which are readily expressed. The ESTJ is not afraid to stand up for what she believes is right even in the face of overwhelming odds. ESTJs are able to make the tough calls.</p><p>Occupations attracting ESTJs include teaching, banking, political office, and management at all levels.</p><p>ESTJs are very good at making impersonal decisions quickly, and standing by those decisions. They live in their Extraverted Thinking functioning, thus, their prime directive is in discovering that which is true and logical in the events of the real world. Circumstances calling for product invite the ESTJ to supervise or direct other individuals toward production and productivity. Extraverts are attracted to the &quot;object,&quot; the external things and people in observable reality. This bent translates into a natural interest in goods and material objects.</p><p>The secondary Introverted Sensing is like that of the ISTJ, but not as strong. Si provides practical form and concept data to the Te head, however, form is not the overriding principle, especially if Thinking has already decided. In times of need, ESTJs are tempted to overlook even necessary information if its absence impedes closure. Secondary sensing sometimes translates into interest in sports. The persistence of primary Thinking gives many ESTJs a desire for discipline and regimen which can be beneficial in skills development in the arena.</p><p>As the ESTJ matures, and as situations arise which call for suspension of criticism, Extraverted iNtuition is allowed to play. Under the leadership of the Te function, iNtuition gravitates toward the discovery of broad categories which at worst amount to stereotypes. Those ESTJs who hone their Ne abilities may find success in academia. (I've encountered ESTJs whose Ne overshadows the auxiliary Si function--for whatever reason--to the extent that there is an appearance of NT radical geekism.)</p><p>This function may rarely be expressed. ESTJs who have cultivated, or have been blessed with, a &quot;natural indirect expression of good will by inference,&quot; have great prospects of developing genuine friendships (as opposed to ESTJs who merely act out the behavior of Extraverted Feeling). Such a weak, introverted function is best observed in facial expression, eye contact, body language, and verbally only by implication.</p>",
    "famous": [
        "James Monroe",
        "Andrew Jackson",
        "Harry S. Truman",
        "Lyndon B. Johnson",
        "George W. Bush",
        "John D. Rockefeller",
        "Billy Graham",
        "Pat Summit",
        "Elliot Ness",
        "Phil Fulmer"
    ]
}
