{
    "type": "ESTP",
    "long_name": "Extraverted Sensing Thinking Perceiving",
    "description": "<p>ESTPs are spontaneous, active folks. Like the other SPs, ESTPs get great satisfaction from acting on their impulses. Activities involving great power, speed, thrill and risk are attractive to the ESTP. Chronic stifling of these impulses makes the ESTP feel &quot;dead inside.&quot;</p><p>Gamesmanship is the calling card of the ESTP. Persons of this type have a natural drive to best the competition. Some of the most successful salespersons are ESTPs. P.T. Barnum (&quot;Never give a sucker an even break&quot;) illustrates the unscrupulous contingent of this type.</p><p>Almost unconsciously the ESTP looks for nonverbal, nearly subliminal cues as to what makes her quarry &quot;tick.&quot; Once she knows, she waits for just the right time to trump the unsuspecting victim's ace and glory in her conquest. Oddly enough, the ESTP seems to admire and respect anyone who can beat her at her own game.</p><p>&quot;If I was any better, I couldn't stand it!&quot; To an ESTP, admission of weakness feels like failure. He admires strength in himself and in others.</p><p>&quot;Shock effect&quot; is a favored technique of this type to get the attention of his audience. ESTPs love to be at center stage, demonstrating feats of wonder and daring.</p><p>These are the ultimate realists. Extraverted Sensors are at one with objects and experiences now, in the only living, pulsing moment that ever really exists. The Sensor is compelled to see, touch, taste, smell and feel all that moves, wafts, tingles, tinkles, scintillates, vibrates or resonates. Some ESTPs are keenly discriminating; only those elements of singular quality and experience will suffice. Others revel in earthiness. If baseness can elicit shock from more squeamish observers, so much the better.</p><p>Even a consummate Sensor needs to decide which hand to grasp the gusto with; Introverted Thinking is her preferred yardstick. Introverted, and auxiliary to Sensing, the T function maintains a low profile, keeps its opinions mainly to itself, and readily yields to allow Sensing to savor a special moment. The ESTP preference for mental, physical and emotional toughness surely can be traced to this detached, rational function.</p><p>Though only a minor character, Feeling plays an important role in a favorite pastime of ESTPs. This is not to say that ESTPs don't care deeply for others, yet Feeling is such a ready hand-puppet, expedient in disarming the &quot;victim&quot; and exposing the jugular. Sincere Feeling is tertiary and thus relatively simplistic in this type. As such, it can be the undoing of ESTPs at the hands of those they (perhaps unconsciously) come to trust.</p><p>In the inferior (fourth) position, intuition may be virtually absent much of the time. Haziness of inner, symbolic vision is the psychic price of the clarity of sensory awareness. As do other SPs, ESTPs reserve a certain &quot;gut&quot; sense of timing and luck. When repression and stress empower the Shadow, it likely finds expression through intuition in stereotypic perceptions of groups and individuals whom it perceives and hostile or hurtful.</p>",
    "famous": [
        "James Buchanan",
        "Ernest Hemingway",
        "Lucille Ball",
        "Jack Nicholson",
        "Eddie Murphy",
        "Madonna",
        "Joan Cusack",
        "Bruce Willis",
        "Michael J. Fox",
        "Cybil Shepherd"
    ]
}
