{
    "type": "INFP",
    "long_name": "Introverted Intuitive Feeling Perceiving",
    "description": "<p>&quot;I remember the first albatross I ever saw. ... At intervals, it arched forth its vast archangel wings, as if to embrace some holy ark. Wondrous flutterings and throbbings shook it. Though bodily unharmed, it uttered cries, as some king's ghost in super natural distress. Through its inexpressible, strange eyes, methought I peeped to secrets not below the heavens. As Abraham before the angels, I bowed myself...&quot; --(Herman Melville, Moby Dick)</p><p>INFPs never seem to lose their sense of wonder. One might say they see life through rose-colored glasses. It's as though they live at the edge of a looking-glass world where mundane objects come to life, where flora and fauna take on near-human qualities.</p><p>INFP children often exhibit this in a 'Calvin and Hobbes' fashion, switching from reality to fantasy and back again. With few exceptions, it is the NF child who readily develops imaginary playmates (as with Anne of Green Gables's &quot;bookcase girlfriend&quot;--h er own reflection) and whose stuffed animals come to life like the Velveteen Rabbit and the Skin Horse:</p><p>&quot;...Generally, by the time you are Real, most of your hair has been loved off, and your eyes drop out and you get loose in the joints and very shabby. But these things don't matter at all, because once you are Real you can't be ugly, except to people who don't understand...&quot; (the Skin Horse)</p><p>INFPs have the ability to see good in almost anyone or anything. Even for the most unlovable the INFP is wont to have pity.</p><p>Rest you, my enemy,<br/>Slain without fault,<br/>Life smacks but tastelessly<br/>Lacking your salt!<br/>Stuck in a bog whence naught<br/>May catapult me,<br/>Come from the grave, long-sought,<br/>Come and insult me!.<br/><br/><br/>--(Steven Vincent Benet, Elegy for an Enemy)</p><p>Their extreme depth of feeling is often hidden, even from themselves, until circumstances evoke an impassioned response:</p><p>&quot;I say, Queequeg! Why don't you speak? It's I--Ishmael.&quot; But all remained still as before. ... Something must have happened. Apoplexy! ... And running up after me, she caught me as I was again trying to force open the door. ... &quot;Have to burst it open,&quot; said I, and was running down the entry a little, for a good start, when the landlady caught me, again vowing I should not break down her premises; but I tore from her, and with a sudden bodily rush dashed myself full against the mark.&quot;--(Melville, Moby Dick)</p><p>Of course, not all of life is rosy, and INFPs are not exempt from the same disappointments and frustrations common to humanity. As INTPs tend to have a sense of failed competence, INFPs struggle with the issue of their own ethical perfection, e.g., perfo rmance of duty for the greater cause. An INFP friend describes the inner conflict as not good versus bad, but on a grand scale, Good vs. Evil. Luke Skywalker in Star Wars depicts this conflict in his struggle between the two sides of &quot;The Force.&quot; Although the dark side must be reckoned with, the INFP believes that good ultimately triumphs.</p><p>Some INFPs have a gift for taking technical information and putting it into layman's terms. Brendan Kehoe's Zen and the Art of the Internet is one example of this &quot;de-jargoning&quot; talent in action.</p><p>INFPs live primarily in a rich inner world of introverted Feeling. Being inward-turning, the natural attraction is away from world and toward essence and ideal. This introversion of dominant Feeling, receiving its data from extraverted intuition, must be the source of the quixotic nature of these usually gentle beings. Feeling is caught in the approach- avoidance bind between concern both for people and for All Creatures Great and Small, and a psycho-magnetic repulsion from the same. The &quot;object,&quot; be it homo sapiens or a mere representation of an organism, is valued only to the degree that the object contains some measure of the inner Essence or greater Good. Doing a good deed, for example, may provide intrinsic satisfaction which is only secondary to the greater good of striking a blow against Man's Inhumanity to Mankind.</p><p>Extraverted intuition faces outward, greeting the world on behalf of Feeling. What the observer usually sees is creativity with implied good will. Intuition spawns this type's philosophical bent and strengthens pattern perception. It combines as auxiliary with introverted Feeling and gives rise to unusual skill in both character development and fluency with language--a sound basis for the development of literary facility. If INTPs aspire to word mechanics, INFPs would be verbal artists.</p><p>Sensing is introverted and often invisible. This stealth function in the third position gives INFPs a natural inclination toward absent- mindedness and other-worldliness, however, Feeling's strong people awareness provides a balancing, mitigating effect. This introverted Sensing is somewhat categorical, a subdued version of SJ sensing. In the third position, however, it is easily overridden by the stronger functions.</p><p>The INFP may turn to inferior extraverted Thinking for help in focusing on externals and for closure. INFPs can even masquerade in their ESTJ business suit, but not without expending considerable energy. The inferior, problematic nature of Extraverted Thinking is its lack of context and proportion. Single impersonal facts may loom large or attain higher priority than more salient principles which are all but overlooked.</p>",
    "famous": [
        "William Shakespeare",
        "Helen Keller",
        "Carl Rogers",
        "Dick Clark",
        "Lisa Kudrow",
        "John F. Kennedy",
        "Julia Roberts",
        "Jacqueline Kennedy Onasis",
        "James Taylor",
        "Laura Ingalls Wilder"
    ]
}
