{
    "type": "ISFP",
    "long_name": "Introverted Sensing Feeling Perceiving",
    "description": "<p>ISFPs are the first to hear the different drummer. Many eagerly plunge into new fashions, avant garde experiences, 'hip' trends--some even setting the trends.</p><p>More in touch with the reality of their senses than their INFP counterparts, ISFPs live in the here and now. Their impulses yearn to be free, and are often loosed when others least expect it. The ISFP who continually represses these impulses feels 'dead inside' and may eventually cut and run. (One ISFP friend has become nonambulatory within the past few years. He will still, on impulse, leave home in the middle of the night and go to Las Vegas or wherever, regardless of the difficulties of his physical condition.)</p><p>ISFPs may be quite charming and ingratiating on first acquaintance, flowing with compliments which may (or may not) be deserved. On other occasions, the same individual may be aloof and detached. Some ISFP males are fiercely competitive, especially in sport or table games, and may have great difficulty losing. This competitive nature, also seen in other SP types, sometimes fosters 'lucky,' 'gut' feelings and a willingness to take risks.</p><p>Organized education is difficult for the majority of ISFPs, and many drop out before finishing secondary education. Their interest can be held better through experiential learning, at which many excel. ISFPs will practice playing an instrument or honing a favored skill for hours on end, not so much as practice as for the joy of the experience.</p><p>Differential diagnosis:</p><p>ISFPs are less fantasy-oriented than INFPs. These types are often confused, however, INFPs lean strongly to daydreams, poetry, prose and more philosophical pursuits; ISFPs often live out 'id' experiences rather than writing or even talking about them.</p><p>ISFJs are driven by the conventional, by 'should's and 'ought's; ISFPs internalize their Feeling (by nature a judging function) which bursts out spontaneously and leaves as quickly and mysteriously as it came.</p><p>Because of these variant expressions of Feeling judgement, ISFPs are sometimes confused with ESFJs, but keep themselves more aloof, more often concealing the feelings that ESFJs are so apt to expose.</p><p>ESFPs express thoughts more readily (and, in the main, skillfully). ISFPs can and do perform admirably in the spotlight, but generally have little to say about the performance. For example, few ISFPs would be disc-jockeys, a field strongly represented by ES_Ps.</p><p>Feeling, unbridled by the external forces of society and substance, is the dominant function. ISFPs spontaneously develop their own codes and credos, about which they are quite sober and intense. ISFPs are questors, driven to find the pure and ideal, as personally and individually defined. Feeling may temporarily turn outward, but cannot be long sustained beyond its cloistered home.</p><p>If the individual has values greater than herself, feeling may express itself in valiant acts of selflessness. Turned in upon self, however, it becomes an unscrupulous, capricious enigma, capable even of heinous acts of deception and treachery.</p><p>ISFPs keep a finger on the pulse of here and now. They are more adept at doing than considering, at acting than reflecting, at tasting than wondering. As do most SPs, ISFPs keenly sense color, sound, texture, and movement. It is not unusual for ISFPs to excel in sensory, motor, or kinesthetic abilities.</p><p>ISFPs cherish their impulses. Some of the most beautiful, graceful, and artistic performances are the result of this drive for physical, sensate expression.</p><p>Tertiary intuition works best in the background of the ISFP's inner world. Perhaps this is the source of the &quot;gut feeling&quot; SPs consult in matters of chance. However &quot;lucky&quot; the ISFP may be, intuition as a means of communication is a poor servant, evidenced in spoonerisms, and non sequiturs and mixed metaphors.</p><p>The ISFP may employ Extraverted Thinking in external situations requiring closure. As is the case with inferior functions, such Thinking behaves in an all or nothing manner. Thus, as with other FP types, the ISFP's Extraverted Thinking is at risk for a lack of context and proportion. In most cases, persons of this type enjoy greater facility operating in the open-ended style of sensing, implying the opinions of feeling values in the indirect fashion characteristic of introverted functions.</p>",
    "famous": [
        "Paul McCartney",
        "Michael Jackson",
        "Elizabeth Taylor",
        "Marilyn Monroe",
        "Ulysses S. Grant",
        "Yogi Berra",
        "Magic Johnson",
        "Kevin Costner",
        "Liberace",
        "John Travolta"
    ]
}
