{
    "type": "ISTJ",
    "long_name": "Introverted Sensing Thinking Judging",
    "description": "<p>&quot;It is in keeping with tradition throughout our history that I should express simply and directly the opinions which I hold concerning some of the matters of present importance.&quot; --Herbert Hoover, Inaugural Address, Monday, March 4, 1929.</p><p>ISTJs are often called inspectors. They have a keen sense of right and wrong, especially in their area of interest and/or responsibility. They are noted for devotion to duty. Punctuality is a watchword of the ISTJ. The secretary, clerk, or business(wo)man by whom others set their clocks is likely to be an ISTJ.</p><p>As do other Introverted Thinkers, ISTJs often give the initial impression of being aloof and perhaps somewhat cold. Effusive expression of emotional warmth is not something that ISTJs do without considerable energy loss.</p><p>ISTJs are most at home with &quot;just the facts, Ma'am.&quot; They seem to perform at highest efficiency when employing a step-by-step approach. Once a new procedure has proven itself (i.e., has been shown &quot;to work,&quot;) the ISTJ can be depended upon to carry it through, even at the expense of their own health.</p><p>ISTJs are easily frustrated by the inconsistencies of others, especially when the second parties don't keep their commitments. But they usually keep their feelings to themselves unless they are asked. And when asked, they don't mince words. Truth wins out over tact. The grim determination of the ISTJ vindicates itself in officiation of sports events, judiciary functions, or an other situation which requires making tough calls and sticking to them.</p><p>His SJ orientation draws the ISTJ into the service of established institutions. Home, social clubs, government, schools, the military, churches -- these are the bastions of the SJ. &quot;We've always done it this way&quot; is often reason enough for many ISTJs. Threats to time-honored traditions or established organizations (e.g., a &quot;run&quot; on the bank) are the undoing of SJs, and are to be fought at all costs.</p><p>Si is oriented toward the world of forms, essences, generics. Time is such a form, a quantifiable essense of exactitude, the standard to which external events are held. For both of the IS_J types, the sense of propriety comes from the clear definition of these internal forms. An apple &quot;should&quot; have certain qualities, against which all apples are evaluated. A &quot;proper&quot; chair has four legs, (and other qualities this poor INTP can only guess). Jung viewed introverted sensing as something of an oxymoron, in that the natural direction of senses is outward toward the object, rather than inward and away from it. One has the sense that Introverted Sensors are drawn more to the measure of the concept of the perceived object than to the experience of that perception.</p><p>The moderation of the Te function serves to socialize the expression of these forms. When the Si function is ready to relinquish the data, Te may speak. Otherwise, silence is golden. ISTJs seem to have a few favorite forms (the tried and true) which may serve for most occasions. My ISTJ dad woke me every morning with the same phrase for more years than I care to remember. Asked, &quot;How are you?&quot; he answered with the same stock phrase. (&quot;As well as my age and habits will permit&quot; was used for about two decades.) &quot;It's a good form, a sound form--it's the form for me.&quot;</p><p>Since Fi is turned inward, it is rarely expressed. Perhaps this enables the ISTJ to resolutely accept that &quot;we are all doomed.&quot; When told that Lazarus had died, Thomas said, &quot;Let us go and die with him.&quot; (He could just as well have said something like, &quot;I knew this was bound to happen sooner or later.&quot;) Only in times of great distress is the Introverted Feeling expressed (as I witnessed in my dad when a neighbor's son was killed in a hunting accident). Otherwise, feeling is inferred, or expressed nonverbally, through eye contact, or an encouraging smile.</p><p>The Ne function of an ISTJ does not serve her very well. It needs a lot of help. She was surprised, for example, to find that someone she had talked with only by phone had red hair, because she &quot;didn't usually like&quot; people with red hair! This inferior Ne seems to be a major source of, and a natural breeding ground for, stereotypes. Failure of the banking system is but one bogeyman which arises from the fear which feeds on the ISTJ's mistrust of real world possibilities. The shadow inhabiting the inferior Ne strikes at the precious forms and standards in the heart of the dominant Si function.</p>",
    "famous": [
        "George Washington",
        "Andrew Johnson",
        "Benjamin Harrison",
        "Herbert Hoover",
        "George H. W. Bush",
        "Paul Coverdale",
        "Jackie Joyner-Kersee",
        "Evander Holyfield",
        "Jack Webb"
    ]
}
