{
    "type": "ENTP",
    "long_name": "Extraverted Intuitive Thinking Perceiving",
    "description": "<p>&quot;Clever&quot; is the word that perhaps describes ENTPs best. The professor who juggles half a dozen ideas for research papers and grant proposals in his mind while giving a highly entertaining lecture on an abstruse subject is a classic example of the type. So is the stand-up comedian whose lampoons are not only funny, but incisively accurate.</p><p>ENTPs are usually verbally as well as cerebrally quick, and generally love to argue--both for its own sake, and to show off their often-impressive skills. They tend to have a perverse sense of humor as well, and enjoy playing devil's advocate. They sometimes confuse, even inadvertently hurt, those who don't understand or accept the concept of argument as a sport.</p><p>ENTPs are as innovative and ingenious at problem-solving as they are at verbal gymnastics; on occasion, however, they manage to outsmart themselves. This can take the form of getting found out at &quot;sharp practice&quot;--ENTPs have been known to cut corners without regard to the rules if it's expedient -- or simply in the collapse of an over-ambitious juggling act. Both at work and at home, ENTPs are very fond of &quot;toys&quot;--physical or intellectual, the more sophisticated the better. They tend to tire of these quickly, however, and move on to new ones.</p><p>ENTPs are basically optimists, but in spite of this (perhaps because of it?), they tend to become extremely petulant about small setbacks and inconveniences. (Major setbacks they tend to regard as challenges, and tackle with determin- ation.) ENTPs have little patience with those they consider wrongheaded or unintelligent, and show little restraint in demonstrating this. However, they do tend to be extremely genial, if not charming, when not being harassed by life in general.</p><p>In terms of their relationships with others, ENTPs are capable of bonding very closely and, initially, suddenly, with their loved ones. Some appear to be deceptively offhand with their nearest and dearest; others are so demonstrative that they succeed in shocking co-workers who've only seen their professional side. ENTPs are also good at acquiring friends who are as clever and entertaining as they are. Aside from those two areas, ENTPs tend to be oblivious of the rest of humanity, except as an audience -- good, bad, or potential.</p><p>ENTPs are nothing if not unique. Brave new associations flow freely from the unconscious into the world of the living. Making, discovering and developing connections between and among two or more of anything is virtually automatic. The product of intuition is merely an icon of process; ENTPs are in the business of change, improvement, experimentation.</p><p>The attraction Extraverted iNtuition has toward the real and physical amounts to a cosmic non sequitur: theory is drawn to practice. Such encounters are clearly puzzling. Both parties--the intuitor and the realist--are aware of a xenic quality in their meeting, with reactions ranging from recoil to reverie.</p><p>Thinking is iNtuition's ready assistant, an embodiment of the sort of logic found in laws, boards and circuits. Thinking's job is to lend focus and direction to iNtuition's critical mass. The temporary habitations of changeling iNtuition are constructed of Boolean materials from Thinking's storehouse. Ultimately, Thinking is no match for iNtuition's prodigiousness. Systems lie in various states of disarray, fragmentary traces of Thinking's feverish attempts to shadow and undergird the leaps of the dominant function. One can only suppose that Thinking must continue to work during REM sleep pulling together iNtuition's brainchildren into integral wholes.</p><p>To the extent that Feeling is developed, ENTPs extravert Feeling judgment. As a result, it is not uncommon to find affability and bonhomie in members of this species. Tertiary functions are potentially utilitarian. Their limitations appear in their relative underdevelopment, diminished endurance, and vulnerability. ENTPs may harness Feeling's good will in areas such as sales, service, drama, humor and art. ENTP loyalty often runs high and can be hooked by those the ENTP counts as friends.</p><p>Like a tail on the kite of iNtuition, Introverted Sensing counterweighs these beings drawn to nonconformity and anarchy. These shadowy sensory forms, so familiar to SJ types, serve as lodestones which many ENTPs employ Herculean measures to escape. &quot;Question authority! (then do exactly what it tells you)&quot; sums up the dilemma in which ENTPs may find themselves by attempting to best the tarbaby Sensing. Occasionally acknowledging awareness of norms and abnormality could, in theory, be potentially freeing. Additionally, I've noticed that ENTPs have the need to have areas of expertise/excellence/uniqueness in which one is second to none. I've never beaten an ENTP at his/her own game--not in the final analysis. (e.g., just tonight, my neighbor who is recuperating from an illness received a call from an ENTP friend offering his special recipe for tea. The instructions required only the finest ingredients, a particular brand of orange juice, tea made with a ball--none of those horrid teabags--..., which will of course make the best tea of which he himself drinks 50 gallons each winter!)</p>",
    "famous": [
        "Alexander the Great",
        "Sir Walter Raleigh",
        "John Adams",
        "Teddy Roosevelt",
        "Thomas Edison",
        "George Carlin",
        "Weird Al Yankovick",
        "Alfred Hitchcock",
        "Tom Hanks",
        "Celine Dion"
    ]
}
