{
    "type": "ESFJ",
    "long_name": "Extraverted Sensing Feeling Judging",
    "description": "<p>Guardians of birthdays, holidays and celebrations, ESFJs are generous entertainers. They enjoy and joyfully observe traditions and are liberal in giving, especially where custom prescribes.</p><p>All else being equal, ESFJs enjoy being in charge. They see problems clearly and delegate easily, work hard and play with zest. ESFJs, as do most SJs, bear strong allegiance to rights of seniority. They willingly provide service (which embodies life's meaning) and expect the same from others.</p><p>ESFJs are easily wounded. And when wounded, their emotions will not be contained. They by nature &quot;wear their hearts on their sleeves,&quot; often exuding warmth and bonhomie, but not infrequently boiling over with the vexation of their souls. Some ESFJs channel these vibrant emotions into moving dramatic performances on stage and screen.</p><p>Strong, contradictory forces consume the ESFJ. Their sense of right and wrong wrestles with an overwhelming rescuing, 'mothering' drive. This sometimes results in swift, immediate action taken upon a transgressor, followed by stern reprimand; ultimately, however, the prodigal is wrested from the gallows of their folly, just as the noose tightens and all hope is lost, by the very executioner!</p><p>An ESFJ at odds with self is a remarkable sight. When a decision must be made, especially one involving the risk of conflict (abhorrent to ESFJs), there ensues an in-house wrestling match between the aforementioned black-and-white Values and the Nemesis of Discord. The contender pits self against self, once firmly deciding with the Right, then switching to Prudence to forestall hostilities, countered by unswerving Values, ad exhaustium, winner take all.</p><p>As caretakers, ESFJs sense danger all around--germs within, the elements without, unscrupulous malefactors, insidious character flaws. The world is a dangerous place, not to be trusted. Not that the ESFJ is paranoid; 'hyper-vigilant' would be more precise. And thus they serve excellently as protectors, outstanding in fields such as medical care and elementary education.</p><p>ESFJs live in their Extraverted Feeling functioning. Feeling, a rational (i.e., deciding) function, expresses opinions easily in the E world of objects and people. ESFJs have the ability to express warmth, rage, and a range of other emotions. Actions are encouraged or rebuked based on how they affect other people, especially people near and dear to the ESFJ. This type's vocal decisiveness predisposes many of its number to facility with administration and supervision.</p><p>The secondary Introverted Sensing function aids and abets the dominant Fe in that sensate data is collected and at once compared with the inner forms or standards. Data on which decisions are made are thus focused and given a contrast which tends to be stronger and clearer than the original stimuli. The strengthening effect of Si on Fe may be responsible for this type's reputation for wearing their &quot;hearts on their sleeves.&quot; At any rate, ESFJs reflect the &quot;black and white&quot; view of reality which is common to the SJ types.</p><p>Extraverted iNtuition is tertiary--as the ESFJ matures, and as situations arise which call for suspension of criticism, Ne is allowed to play. Under the leadership of the Fe function, iNtuition allows for a loosening of the more rigid Si rights and wrongs; teasing and slapstick humor emerge. ESFJs are also capable of discerning patterns and philosophies, but such perceiving is subject to the weakness of the tertiary position, and the results often lack the variety and complexity of connections that more complex systems require.</p><p>The inferior Ti function may rarely be expressed. In fact, ESFJs may take affront at the aloof, detached nature of dominant Ti types, or conversely, be drawn to them. Some ESFJs construct rationale which have the appearance of (Jungian) Thinking logic, but under scrutiny are in fact command performances of &quot;Thinking in the service of Feeling,&quot; (i.e., Thinking-like conclusions which do not obey the tenets of impersonal logic; they rather construct scenarios from only those &quot;hard, cold facts&quot; which support the conclusion reached by the dominant Extraverted Feeling function. To wit:</p><p>You don't sew with a fork, so I see no reason to eat with knitting needles.</p><p>-- Miss Piggy, on eating Chinese Food</p>",
    "famous": [
        "Bill Clinton",
        "Don Knotts",
        "Terry Bradshaw",
        "Sally Struthers",
        "Mary Tyler Moore",
        "Steve Spurrier",
        "Danny Glover",
        "Nancy Kerrigan",
        "William McKinley",
        "Jack Benny"
    ]
}
