{
    "type": "INFJ",
    "long_name": "Introverted Intuitive Feeling Judging",
    "description": "<p>Beneath the quiet exterior, INFJs hold deep convictions about the weightier matters of life. Those who are activists -- INFJs gravitate toward such a role -- are there for the cause, not for personal glory or political power.</p><p>INFJs are champions of the oppressed and downtrodden. They often are found in the wake of an emergency, rescuing those who are in acute distress. INFJs may fantasize about getting revenge on those who victimize the defenseless. The concept of 'poetic j ustice' is appealing to the INFJ.</p><p>&quot;There's something rotten in Denmark.&quot; Accurately suspicious about others' motives, INFJs are not easily led. These are the people that you can rarely fool any of the time. Though affable and sympathetic to most, INFJs are selective about their friends . Such a friendship is a symbiotic bond that transcends mere words.</p><p>INFJs have a knack for fluency in language and facility in communication. In addition, nonverbal sensitivity enables the INFJ to know and be known by others intimately.</p><p>Writing, counseling, public service and even politics are areas where INFJs frequently find their niche.</p><p>Introverted intuitives, INFJs enjoy a greater clarity of perception of inner, unconscious processes than all but their INTJ cousins. Just as SP types commune with the object and &quot;live in the here and now&quot; of the physical world, INFJs readily grasp the hidden psychological stimuli behind the more observable dynamics of behavior and affect. Their amazing ability to deduce the inner workings of the mind, will and emotions of others gives INFJs their reputation as prophets and seers. Unlike the confining, routinizing nature of introverted sensing, introverted intuition frees this type to act insightfully and spontaneously as unique solutions arise on an event by event basis.</p><p>Extraverted feeling, the auxiliary deciding function, expresses a range of emotion and opinions of, for and about people. INFJs, like many other FJ types, find themselves caught between the desire to express their wealth of feelings and moral conclusions about the actions and attitudes of others, and the awareness of the consequences of unbridled candor. Some vent the attending emotions in private, to trusted allies. Such confidants are chosen with care, for INFJs are well aware of the treachery that can reside in the hearts of mortals. This particular combination of introverted intuition and extraverted feeling provides INFJs with the raw material from which perceptive counselors are shaped.</p><p>The INFJ's thinking is introverted, turned toward the subject. Perhaps it is when the INFJ's thinking function is operative that he is most aloof. A comrade might surmise that such detachment signals a disillusionment, that she has also been found lacking by the sardonic eye of this one who plumbs the depths of the human spirit. Experience suggests that such distancing is merely an indication that the seer is hard at work and focusing energy into this less efficient tertiary function.</p><p>INFJs are twice blessed with clarity of vision, both internal and external. Just as they possess inner vision which is drawn to the forms of the unconscious, they also have external sensing perception which readily takes hold of worldly objects. Sensing, however, is the weakest of the INFJ's arsenal and the most vulnerable. INFJs, like their fellow intuitives, may be so absorbed in intuitive perceiving that they become oblivious to physical reality. The INFJ under stress may fall prey to various forms of immediate gratification. Awareness of extraverted sensing is probably the source of the &quot;SP wannabe&quot; side of INFJs. Many yearn to live spontaneously; it's not uncommon for INFJ actors to take on an SP (often ESTP) role.</p>",
    "famous": [
        "Jimmy Carter",
        "Nathaniel Hawthorne",
        "Mother Teresa",
        "Martin Luther King, Jr.",
        "Tom Selleck",
        "Oprah Winfrey",
        "Richard Gere",
        "Billy Crystal",
        "Carrie Fisher",
        "Martin Van Buren"
    ]
}
