{
    "type": "ISFJ",
    "long_name": "Introverted Sensing Feeling Judging",
    "description": "<p>ISFJs are characterized above all by their desire to serve others, their &quot;need to be needed.&quot; In extreme cases, this need is so strong that standard give-and-take relationships are deeply unsatisfying to them; however, most ISFJs find more than enough with which to occupy themselves within the framework of a normal life. (Since ISFJs, like all SJs, are very much bound by the prevailing social conventions, their form of &quot;service&quot; is likely to exclude any elements of moral or political controversy; they specialize in the local, the personal, and the practical.)</p><p>ISFJs are often unappreciated, at work, home, and play. Ironically, because they prove over and over that they can be relied on for their loyalty and unstinting, high-quality work, those around them often take them for granted--even take advantage of them. Admittedly, the problem is sometimes aggravated by the ISFJs themselves; for instance, they are notoriously bad at delegating (&quot;If you want it done right, do it yourself&quot;). And although they're hurt by being treated like doormats, they are often unwilling to toot their own horns about their accomplishments because they feel that although they deserve more credit than they're getting, it's somehow wrong to want any sort of reward for doing work (which is supposed to be a virtue in itself). (And as low-profile Is, their actions don't call attention to themselves as with charismatic Es.) Because of all of this, ISFJs are often overworked, and as a result may suffer from psychosomatic illnesses.</p><p>In the workplace, ISFJs are methodical and accurate workers, often with very good memories and unexpected analytic abilities; they are also good with people in small-group or one-on-one situations because of their patient and genuinely sympathetic approach to dealing with others. ISFJs make pleasant and reliable co-workers and exemplary employees, but tend to be harried and uncomfortable in supervisory roles. They are capable of forming strong loyalties, but these are personal rather than institutional loyalties; if someone they've bonded with in this way leaves the company, the ISFJ will leave with them, if given the option. Traditional careers for an ISFJ include: teaching, social work, most religious work, nursing, medicine (general practice only), clerical and and secretarial work of any kind, and some kinds of administrative careers.</p><p>While their work ethic is high on the ISFJ priority list, their families are the centers of their lives. ISFJs are extremely warm and demonstrative within the family circle--and often possessive of their loved ones, as well. When these include Es who want to socialize with the rest of the world, or self-contained ITs, the ISFJ must learn to adjust to these behaviors and not interpret them as rejection. Being SJs, they place a strong emphasis on conventional behavior (although, unlike STJs, they are usually as concerned with being &quot;nice&quot; as with strict propriety); if any of their nearest and dearest depart from the straight-and-narrow, it causes the ISFJ major embarrassment: the closer the relationship and the more public the act, the more intense the embarrassment (a fact which many of their teenage children take gleeful advantage of). Over time, however, ISFJs usually mellow, and learn to regard the culprits as harmless eccentrics :-). Needless to say, ISFJs take infinite trouble over meals, gifts, celebrations, etc., for their loved ones--although strong Js may tend to focus more on what the recipient should want rather than what they do want.</p><p>Like most Is, ISFJs have a few, close friends. They are extremely loyal to these, and are ready to provide emotional and practical support at a moment's notice. (However, like most Fs they hate confrontation; if you get into a fight, don't expect them to jump in after you. You can count on them, however, run and get the nearest authority figure.) Unlike with EPs, the older the friendship is, the more an ISFJ will value it. One ISFJ trait that is easily misunderstood by those who haven't known them long is that they are often unable to either hide or articulate any distress they may be feeling. For instance, an ISFJ child may be reproved for &quot;sulking,&quot; the actual cause of which is a combination of physical illness plus misguided &quot;good manners.&quot; An adult ISFJ may drive a (later ashamed) friend or SO into a fit of temper over the ISFJ's unexplained moodiness, only afterwards to explain about a death in the family they &quot;didn't want to burden anyone with.&quot; Those close to ISFJs should learn to watch for the warning signs in these situations and take the initiative themselves to uncover the problem.</p><p>As for ISTJs, the dominant Si is oriented toward the world of forms, essences, generics. Again, &quot;for both of the IS_J types, the sense of propriety comes from the clear definition of these internal forms. ... A 'proper' chair has four legs,&quot; etc. (Jung saw IS as something of an oxymoron: sensing, which is a perceiving function, focused inward and thus away from that which is perceived (the &quot;object&quot;). In this light, he described this sensing as something removed from reality, full of archetypes/mythical figures/hobgoblins; sensing of one's own set of forms.)</p><p>A kind of &quot;regression toward the mean&quot; provided by the Fe auxiliary function serves to socialize the expression of these forms. I suppose it's the auxiliary nature of this Feeling, coupled with the balancing effect of {detachment from the internal idiosyncratic view of free-floating data perceptions} that makes ISFJs tentative, conservative, and reticent to boldly state the rights and wrongs in the relational world. (Loosely translated, ISFJs like to keep their perceptions to themselves, and aren't sure enough that what they &quot;see&quot; as Introverted Sensors has any relevance to the outside world. Thus the perception, based on unworldly data, may not be true. The obedient Extraverted Feeling function must therefore refrain from strong statements expressing these opinions.)</p><p>Introverted Thinking is turned inward and is largely invisible. It is only with great difficulty, if at all, that the ISFJ could willingly commit anyone to their doom. Perhaps this explains why ISFJs are loyal to the end; there is no sense of purely objective (i.e., impersonal) judgement of anyone but themselves (and that only by their own standards). Here is this type's achilles heel that makes many of them so vulnerable to the scoundrels and ne'er-do-wells who often use and abuse them.</p><p>ISFJs are easily undone by Extraverted iNtuition, their inferior function. Believing in the fantastic, and disbelieving the technologically extant, are errors that my guide the gullible (or unfoundedly sceptical) ISFJ off a precipice of mis-conclusion. (One of our co-workers' mothers adamantly refused to believe that Dave Letterman's mom was actually at the olympics in Norway talking with the athletes and handing out hams! She suspected technological trickery.)</p><p>This childlike Ne is, however, the likely source (coupled with fun-loving Extraverted Feeling) of the practical joking, punning and (usually harmless) impishness of some ISFJs.</p>",
    "famous": [
        "Louisa May Alcott",
        "Queen Elizabeth II of England",
        "Robert E. Lee",
        "Queen Mary I of England",
        "William H. Taft",
        "Kristi Yamaguchi"
    ]
}
